Attribute VB_Name = "Enums"
Option Explicit

'------------------------------------------------------------------------------
' (概要)
'  誤り訂正レベル
'------------------------------------------------------------------------------
Public Enum ErrorCorrectionLevel
    L
    M
    Q
    H
End Enum

'------------------------------------------------------------------------------
' (概要)
'  符号化モード
'------------------------------------------------------------------------------
Public Enum EncodingMode
    UNKNOWN
    NUMERIC
    ALPHA_NUMERIC
    EIGHT_BIT_BYTE
    KANJI
End Enum

